STACKSEG SEGMENT PARA STACK 'STACK' ;сегмент стека класса STACK по адресу кратному 16
    DB 200h DUP (?) ;выделяем стек размером 200 байт
STACKSEG ENDS ;конец сегмента стека

DATA SEGMENT WORD 'DATA' ;сегмент данных класса DATA начинающийся с адреса кратному 2
    STRING DB 100, ?
           DB 100 DUP ('$') ;создание строки и запись в неё символа конца строки
DATA ENDS ;конец сегмента данных

CODE SEGMENT "CODE" ;сегмент кода CODE
    ASSUME CS:CODE, DS:DATA ;автоматическое связывание сегментов данных с метками
START: ;метка, указывающая на начало программы
    MOV AX, DATA ;перемещение адрес метки DATA в регистр AX
    MOV DS, AX ;перемещение содержимого AX в DS 

    MOV AH, 0Ah ;считывание строки из stdin в буфер
    MOV DX, OFFSET STRING ;помещаем смещение данных в регистр данных
    INT 21h ;вводим строку с консоли

    MOV BX, 2 ;задаём индекс строки, игнорируя технические символы
    MOV AH, 02h
    MOV DL, 13 ;перевод на следующую строку
    INT 21h ;прерывание
    MOV DL, 10 ;возврат каретки
    INT 21h ;прерывание
    MOV AH, 09h
    ADD BX, 10
    MOV STRING[BX], '$'

    MOV AH, 4Ch ;команда завершения работы программы
    INT 21h ;прерывание
CODE ENDS ;завершение сегмента кода
END START ;начало программы с метки START