.MODEL TINY ;определяем модель память tiny для того, чтобы создать .com файл
.DOSSEG ;группировка сегментов в соответствии с упорядочиваем сегментов Microsoft
.CODE ;опеределение начала инициализированного сегмента кода в программе
.STARTUP ;директива обеспечения кода инициализации, т.е. инициализация регистров DS, SS и SP, но так как модель программы TINY,
; регистр не изменяется
    MOV AH, 35h ;перемение в регистр AH значения 09h (вывод строки на дисплей)
    MOV AL, 08h ;запись в регистр DX с помощью OFFSET значения метки MSG
    INT 21h ;завершение программы с помощью выполнения команды 4Сh
    MOV AX, BX
END ;директива, отмечающая конец исходного кода программы