PUBLIC X ;объявление глобальной метки X
EXTRN exit: far ;метка exit дальнего управления и дальнего возврата в произвольный адрес

SSTK SEGMENT para STACK 'STACK' ;сегмент стека класса 'STACK' с адресом, кратным 16
	db 100 dup(0) ;выделение памяти размером 100 байт и заполнение её нулями
SSTK ENDS ;конец сегмента стека SSTK

SD1 SEGMENT para public 'DATA' ;глобальный сегмент данных SD1 класса 'DATA' с адресом кратным 16
	X db 'X' ;метка X, указывающая на один байт, в который записан символ X
SD1 ENDS ;конец сегмента данных SD1

SC1 SEGMENT para public 'CODE' ;глобальный сегмент кода SC1 класса 'CODE' с адресом, кратным 16
	assume CS:SC1, DS:SD1 ;связываем сегменты памяти и кода с соответствующими регистрами
main: ;основной блок программы
	jmp exit ;переход к метке кода exit
SC1 ENDS ;конец сегмента кода SC1
END main ;конец программы и объявление main как основного блока кода