EXTRN X: byte ;объявление глобальной метки X размером 1 байт
PUBLIC exit ;объявление глобальной процедуры exit

SD2 SEGMENT para 'DATA' ;сегмент данных класса 'DATA' с адресом, кратным 16
	Y db 'Y' ;метка Y указывающая на байт памяти, в который записан символ Y
SD2 ENDS ;конец сегмента SD2

SC2 SEGMENT para public 'CODE' ;глобальный сегмента кода класса 'CODE' с адресом, кратным 16
	assume CS:SC2, DS:SD2 ;связывание регистров CS и DS с сегментами данных и кода
exit: ;метка exit
	mov ax, seg X ;запись в регистр AX сегментной части адреса X
	mov es, ax ;запись в ES значения из регистра AX
	mov bh, es:X ;записываем в BH значение метки X

	mov ax, SD2 ;помещаем в AX значение метки SD2
	mov ds, ax ;помещаем в DS значение метки AX

	xchg ah, Y ;меняем значения из AH и Y местами
	xchg ah, ES:X ;меняем значения из AH и значение переменной из сегмента ES со смещением X
	xchg ah, Y	;меняем значения AH и Y

	mov ah, 2 ;команда вывода символа из DL в консоль
	mov dl, Y ;записываем значение Y в DL
	int 21h	;прерывание 21h
	
	mov ax, 4c00h ;завершение сегмента exit
	int 21h ;прерывание 21h
SC2 ENDS ;конец сегмента кода SC2
END ;конец программы