SD1 SEGMENT para public 'DATA' ;глобальный сегмент данных SD1 с адресом, кратным 16, класса 'DATA'
	S1 db 'Y' ;метка S1 указывающая на байт в памяти, в который записан символ Y
	db 65535 - 2 dup (0) ;выделяем 65533 байт в памяти и заполняем их нулями
SD1 ENDS ;конец сегмента данных SD1

SD2 SEGMENT para public 'DATA' ;глобальный сегмент данных SD2 с адресом, кратным 16, класса 'DATA'
	S2 db 'E' ;метка S2 указывающая на байт в памяти, в который записан символ E
	db 65535 - 2 dup (0) ;выделяем 65533 байт в памяти и заполняем из нулями
SD2 ENDS ;конец сегмента данных SD2

SD3 SEGMENT para public 'DATA' ;глобальный сегмент данных SD3 с адерсом, кратным 16, класса 'DATA'
	S3 db 'S' ;метка S3 указывающая на байт в памяти, в который записан символ S
	db 65535 - 2 dup (0) ;выделяем 65533 байт в памяти и заполняем их нулями
SD3 ENDS ;конец сегмента данных S3

CSEG SEGMENT para public 'CODE' ;глобальный сегмент кода CODE класса 'CODE' с адресом, кратным 16
	assume CS:CSEG, DS:SD1 ;связывание сегментов кода и памяти с регистрами CS и DS
output: ;процедура output
	mov ah, 2 ;перемещение в AH команды вывода символа на экран
	int 21h ;прерывание 21h
	mov dl, 13 ;помещаем в регистр DL код возврата каретки
	int 21h ;прерывание 21h
	mov dl, 10 ;помещаем в регистр DL код переноса строки
	int 21h ;прерывание 21h
	ret ;конец процедуры
main: ;блок кода main
	mov ax, SD1 ;помещаем в регистр AX значение метки SD1 
	mov ds, ax ;помещаем значение из AX в DS
	mov dl, S1 ;помещаем значение из S1 в DL
	call output ;вызов процедуры output
assume DS:SD2 ;пересвязываем регистр DS с сегментом памяти SD2
	mov ax, SD2 ;помещаем значение SD2 в AX
	mov ds, ax ;помещаем значение AX в DS
	mov dl, S2 ;помещаем значение метки S2 в регистр DL
	call output ;вызываем процедуру output
assume DS:SD3 ;пересвязываем регистр DS с сегментом памяти SD3
	mov ax, SD3 ;помещаем значение из SD3 в AX
	mov ds, ax ;помещаем значение AX в DS
	mov dl, S3 ;помещаем в DL значение метки S3
	call output ;вызов процедуры output
	
	mov ax, 4c00h ;помещаем в AX команду окончания работы программы
	int 21h ;прерывание 21h 
CSEG ENDS ;конец сегмента кода
END main ;конце программы и указание на то, что блок main - основной