INSERT INTO employee
VALUES
(0, 'Элис Сукочева', '2000-07-19', 'Программист'),
(1, 'Вася Малков', '1998-01-02', 'Программист'),
(2, 'Вика Софрнова', '2002-05-01', 'Системный администратор'),
(3, 'Дима Власов', '1995-11-11', 'Руководитель');

INSERT INTO employee_register
VALUES
(0, 0, CURRENT_DATE - 1, 'Понедельник', '08:55:00', 1),
(1, 1, CURRENT_DATE - 1, 'Понедельник', '08:55:00', 1),
(2, 2, CURRENT_DATE - 1, 'Понедельник', '09:05:00', 1),
(3, 3, CURRENT_DATE - 1, 'Понедельник', '10:51:00', 1),
(4, 0, CURRENT_DATE - 1, 'Понедельник', '16:05:00', 2),
(5, 1, CURRENT_DATE - 1, 'Понедельник', '16:06:00', 2),
(6, 2, CURRENT_DATE - 1, 'Понедельник', '19:09:00', 2),
(7, 3, CURRENT_DATE - 1, 'Понедельник', '21:00:00', 2);