PUBLIC output_X ;глобальное объявление output_X для данного модуля
EXTRN X: byte ;объявление глобального X из другого модуля указывающего на 1 байт

DS2 SEGMENT AT 0b800h ;сегмет памяти DS2
	CA LABEL byte ;объявление метки CA, указывающая на один байт в начале сегмента DS2
	ORG 80 * 2 * 2 + 2 * 2 ;увеличиваем программный счётчик компилятора, перенося следующую метку на 324 байта
	SYMB LABEL word ;объявление метки памяти SYMB, указывающая на два байта в сегменте памяти DS2
DS2 ENDS

CSEG SEGMENT PARA PUBLIC 'CODE' ;сегмент кода CSEG класса CODE выравниваемый по параграфу (начинается с адреса кратному 16)
	assume CS:CSEG, ES:DS2 ;определяем регистры для сегментов CSEG и DS2
output_X proc near ;процедура output_X с ближним типом перехода (в пределах этого же сегмента)
	mov ax, DS2 ;перемещаем значение метки DS2 в AX
	mov es, ax ;перемещаем содержимое регистра AX в регистр ES
	mov ah, 10 ;помещаем в AH параметры символа
	mov al, X ;помещаем в AL X - глобальную переменную из другого модуля
	mov symb, ax ;помещаем значение метки SYMB в AX
	ret ;возврат из ближней процедуры
output_X endp ;конец процедуры
CSEG ENDS ;конец сегмента кода
END ;конец программы