EXTRN output_X: near ;глобальное объявление процедуры output_X, находящейся в этом же сегменте памяти, но в другом модуле

STK SEGMENT PARA STACK 'STACK' ;сегмент стека класса 'STACK' размером 100 байт с адресом, кратным 16 (размер параграфа)
	db 100 dup(0) ;выделение 100 байт памяти и заполнение их нулями
STK ENDS ;конец сегмента стека

DSEG SEGMENT PARA PUBLIC 'DATA' ;глобальный сегмент данных класса 'DATA' с адресом кратным 16
	X db 'R' ;определение метки X указывающей на символ R, находящийся в начале сегмента
DSEG ENDS

CSEG SEGMENT PARA PUBLIC 'CODE' ;глобальный сегмент кода класса 'CODE' с адресом кратным 16
	assume CS:CSEG, DS:DSEG, SS:STK ;определение регистрам сегментов соответсвующих меток сегментов для автоматической подставноки
main: ;код программы
	mov ax, DSEG ;перемещение содержимого метки DSEG в AX
	mov ds, ax ;перемещение содержимого регистра AX в DS

	call output_X ;вызов процедуры output_X

	mov ax, 4c00h ;перемещение в регистр AX команды завершения работы программы
	int 21h ;вызов прерывания 21h для завершения работы
CSEG ENDS ;конец сегмента кода

PUBLIC X ;объявление глобальной метки X

END main ;конец программы и определение блока кода main как основного при исполнении программы