SD1 SEGMENT para common 'DATA' ;сегмент данных SD1 класса 'DATA' с адресом кратным 16 и имеющий тип
;common, что значит, что данный сегмент памяти будет объединён с сегментом SD1 из модуля lr03_2_2.asm
;при этом длина сегмента будет 4 байта, поскольку сегмент SD1 из lr03_2_1 имеет размер 4 байта, а сегмент 
;SD1 из данного модуля имеет размер 0 байт, так как память не выделяется (label не выделяет память!)
	C1 LABEL byte ;определение метки C1 типа BYTE
	ORG 1h ;смещение программного счётчика на 1 относительно начала сегмента
	C2 LABEL byte ;определение метки C2 типа BYTE
SD1 ENDS ;конец сегмента данных

CSEG SEGMENT para 'CODE' ;сегмент кода CODE класса 'CODE' и с адресом кратным 16
	ASSUME CS:CSEG, DS:SD1 ;привязываем регистры кода и данных к сегменту кода CSEG и сегменту данных SD1
main: ;начало блока main кода программы
	mov ax, SD1 ;перемещаем значение метки SD1 в AX
	mov ds, ax ;перемещаем значение из регистра AX в DS
	mov ah, 2 ;перемещаем в регистр AH значение 2 (код команды вывода символа на экран)
	mov dl, C1 ;перемещаем в младшую часть регистра DX (DL) значение метки C1
	int 21h ;прерывание 21h
	mov dl, C2 ;перемещаем в младшую часть регистра DX (DL) значение метки C2
	int 21h ;прерывание 21h
	mov ax, 4c00h ;перемещаем в AX код команды завершения работы программы
	int 21h ;прерывание 21h
CSEG ENDS ;конец сегмента
END main ;конец кода с указанием на основной (начальный) блок кода