STK SEGMENT para STACK 'STACK' ;сегмент стека класса 'STACK' с адресом кратным 16 (параграф)
	db 100 dup(0) ;выделяем память для стека размером 100 байт и заполняем её нулями
STK ENDS ;конец сегмента стека

SD1 SEGMENT para common 'DATA' ;сегмент данных класса 'DATA' с адресом кратным 16 (параграф) и 
;имеющий тип common, что значит объединение с сегментами того же имени, по одному и тому же адресу
	W dw 3334h ;запись в метку W значения 3334h (DW указывает на выделение 4-х байт памяти)
SD1 ENDS ;конец сегмента данных
END ;конец кода программы в модуле lr03_2_1.asm
