INSERT INTO employee
VALUES
(0, 'Элис Сукочева', '2000-07-19', 'Программист'),
(1, 'Вася Малков', '1998-01-02', 'Программист'),
(2, 'Вика Софрнова', '2002-05-01', 'Системный администратор'),
(3, 'Дима Власов', '1995-11-11', 'Руководитель'),
(4, 'Лупа Пупов', '1995-11-11', 'Бухгалтерия'),
(5, 'Пупа Лупов', '1995-11-11', 'Бухгалтерия');

INSERT INTO employee_register
VALUES
(1, 4, CURRENT_DATE - 1, 'Понедельник', '07:54:00', 1),
(2, 0, CURRENT_DATE - 1, 'Понедельник', '08:55:00', 1),
(3, 1, CURRENT_DATE - 1, 'Понедельник', '08:55:00', 1),
(4, 5, CURRENT_DATE - 1, 'Понедельник', '09:01:00', 1),
(5, 2, CURRENT_DATE - 1, 'Понедельник', '09:04:00', 1),
(6, 3, CURRENT_DATE - 1, 'Понедельник', '09:01:00', 1),

(7, 0, CURRENT_DATE - 1, 'Понедельник', '12:55:00', 1),
(8, 0, CURRENT_DATE - 1, 'Понедельник', '13:55:00', 2),

(9, 1, CURRENT_DATE - 1, 'Понедельник', '12:05:00', 1),
(10, 1, CURRENT_DATE - 1, 'Понедельник', '12:11:00', 2),

(11, 2, CURRENT_DATE - 1, 'Понедельник', '12:05:00', 1),
(12, 2, CURRENT_DATE - 1, 'Понедельник', '12:20:00', 2),

(13, 3, CURRENT_DATE - 1, 'Понедельник', '12:05:00', 1),
(14, 3, CURRENT_DATE - 1, 'Понедельник', '12:11:00', 2),

(15, 0, CURRENT_DATE - 1, 'Понедельник', '16:05:00', 2),
(16, 1, CURRENT_DATE - 1, 'Понедельник', '16:06:00', 2),
(17, 2, CURRENT_DATE - 1, 'Понедельник', '19:09:00', 2),
(18, 3, CURRENT_DATE - 1, 'Понедельник', '21:00:00', 2),
(19, 4, CURRENT_DATE - 1, 'Понедельник', '21:00:00', 2),
(20, 5, CURRENT_DATE - 1, 'Понедельник', '21:00:00', 2);